{"2":{"1":[{"1":"goog.net.WebChannel.ErrorStatus","5":{"1":"closure/goog/labs/net/webchannel.js","2":259,"3":"https://github.com/google/closure-library/blob/master/closure/goog/labs/net/webchannel.js#L259"},"7":{"1":[{"2":"<p>WebChannel level error conditions.</p>\n<p>Summary of error debugging and reporting in WebChannel:</p>\n<p>Network Error</p>\n<ol><li>By default the webchannel library will set the error status to\nNETWORK_ERROR when a channel has to be aborted or closed. NETWORK_ERROR\nmay be recovered by the application by retrying and opening a new channel.</li><li>There may be lost messages (not acked by the server) when a channel is\naborted. Currently we don&#39;t have a public API to retrieve messages that\nare waiting to be acked on the client side. File a bug if you think it\nis useful to expose such an API.</li><li>Details of why a channel fails are available via closure debug logs,\nand stats events (see webchannel/requeststats.js). Those are internal\nstats and are subject to change. File a bug if you think it&#39;s useful to\nversion and expose such stats as part of the WebChannel API.</li></ol>\n<p>Server Error</p>\n<ol><li>SERVER_ERROR is intended to indicate a non-recoverable condition, e.g.\nwhen auth fails.</li><li>We don&#39;t currently generate any such errors, because most of the time\nit&#39;s the responsibility of upper-layer frameworks or the application\nitself to indicate to the client why a webchannel has been failed\nby the server.</li><li>When a channel is failed by the server explicitly, we still signal\nNETWORK_ERROR to the client. Explicit server failure may happen when the\nserver does a fail-over, or becomes overloaded, or conducts a forced\nshutdown etc.</li><li>We use some heuristic to decide if the network (aka cloud) is down\nv.s. the actual server is down.</li></ol>\n<p>RuntimeProperties.getLastStatusCode is a useful state that we expose to\nthe client to indicate the HTTP response status code of the last HTTP\nrequest initiated by the WebChannel client library, for debugging\npurposes only.</p>\n"}]},"8":{},"11":{"1":{"4":{"1":"number","4":true}},"2":[{"1":"NETWORK_ERROR","2":{"1":[{"2":"<p>Communication to the server has failed.</p>\n"}]}},{"1":"OK","2":{"1":[{"2":"<p>No error has occurred.</p>\n"}]}},{"1":"SERVER_ERROR","2":{"1":[{"2":"<p>The server fails to accept or process the WebChannel.</p>\n"}]}}]},"21":{"1":{"1":"goog.net.WebChannel","3":{"1":"goog.net.WebChannel.html"}},"2":4},"23":"goog.net.WebChannel.ErrorStatus.html","24":"goog.net.WebChannel.ErrorStatus"}]}}